# ws2CreateToolPalette

## Description
Workspace advanced APIs. Create a new tool palette if it doesn't exist.

```pascal
FUNCTION ws2CreateToolPalette(
				univName    : DYNARRAY[] of CHAR;
				displayName : DYNARRAY[] of CHAR): BOOLEAN;
```

```python
def vs.ws2CreateToolPalette(univName, displayName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|univName|DYNARRAY[] of CHAR|   |
|displayName|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2021

## Category
* Workspaces